In [2]:
import pandas as pd

In [59]:
# List any five functions of the pandas library with execution.
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [61]:
df.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [62]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [63]:
pd.Categorical(df['Pclass'])

[3, 1, 3, 1, 3, ..., 2, 1, 3, 1, 3]
Length: 891
Categories (3, int64): [1, 2, 3]

In [51]:
# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
# DataFrame with a new index that starts from 1 and increments by 2 for each row.
datail= {'A': [10, 20, 30, 40],
        'B': [5, 15, 25, 35],
        'C': [1, 2, 3, 4]}

df = pd.DataFrame(data)

new_index = pd.RangeIndex(start=1, stop=len(df)*2, step=2)
df_reindexed = df.copy()
df_reindexed.index = new_index
df_reindexed

    A   B  C
1  10   5  1
3  20  15  2
5  30  25  3
7  40  35  4

In [40]:
# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
# iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
# function should print the sum to the console.
# For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
# # calculate and print the sum of the first three values, which is 60.

data1 = {'values' : [10,20,30,40,50]}
df1 =pd.DataFrame(data1)

def calculate_cval(df1):
    sum=0
    num = int(input("enter the no of index to add"))
    for i in range(0,num):
        temp = sum+ df1['values'][i]
        print(f"{sum} + {df1['values'][i]} = {temp}")
        sum = temp

In [41]:
calculate_cval(df1)

enter the no of index to add 3

0 + 10 = 10
10 + 20 = 30
30 + 30 = 60

In [38]:
# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
# 'Word_Count' that contains the number of words in each row of the 'Text' column.
def counter(df):    
    text_count=[]
    for i in range(len(df['Text'])):
        text_count.append(len(df['Text'][i].split()))
    df['word_count']=text_count
    print(df)
data = {'Text': ['This is a sample text.', 'Count the words.', 'Another example.']}
df = pd.DataFrame(data)

In [39]:
counter(df)

                     Text  word_count
0  This is a sample text.           5
1        Count the words.           3
2        Another example.           2

In [82]:
#Q5 How are DataFrame.size() and DataFrame.shape() different?

# DataFrame.size returns the total number of elements in the DataFrame, which is equal to the number of rows multiplied by the number of columns.
# DataFrame.shape returns a tuple representing the dimensions of the DataFrame. It provides the number of rows and columns in the DataFrame as (rows, columns)

In [ ]:
# Q6 Which function of pandas do we use to read an excel file?
df = pd.read_excel('filename.xlsx')

In [14]:
# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
# addresses in the format 'username@domain.com'. Write a Python function that creates a new column
# 'Username' in df that contains only the username part of each email address.

import pandas as pd
def username_extract(dataframe):
    list1=[]
    username=''
    for i in range(len(data['email'])):
        for j in data['email'][i]:
            if j == "@":
                list1.append(username)
                username = ''
                break
            username = username + j
    df['username'] = list1
    print(df)
data = {"email" : ['john.doe@example.com',"akash2002@gmail.com"]}
df = pd.DataFrame(data)

In [15]:
username_extract(df)

                  email   username
0  john.doe@example.com   john.doe
1   akash2002@gmail.com  akash2002

In [38]:
# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
# all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
# function should return a new DataFrame that contains only the selected rows.
import pandas as pd
def finder(df):
    l1 = df[(df["A"]>5) & (df['B']<10)]
    new_df=pd.DataFrame(l1)
    print(new_df)
    
data={'A':[3,8,6,2,9],
     'B':[5,2,9,3,1],
     'C':[1,7,4,5,2]}

df1=pd.DataFrame(data)

new_selected_df = finder(df1)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2